//10-排序4 统计工龄（20 分）
//给定公司N名员工的工龄，要求按工龄增序输出每个工龄段有多少员工。
//
//输入格式:
//
//输入首先给出正整数N(<=10^5)
//即员工总人数；随后给出N个整数，即每个员工的工龄，范围在[0, 50]。
//
//输出格式:
//
//按工龄的递增顺序输出每个工龄的员工个数，格式为：“工龄:人数”。每项占一行。如果人数为0则不输出该项。
//
//输入样例:
//
//8
//10 2 0 5 7 2 5 2
//输出样例:
//
//0:1
//2:3
//5:2
//7:1
//10:1
#include<iostream>
using namespace std;

int N;
int *a,*t;
int MAX;

int main()
{
	cin >> N;
	
	t = new int[N];
	//将工龄读入临时数组t中 
	for(int i=0; i<N; i++) {
		cin >> t[i];	
	}		
	//从数组t中挑选最大的 
	MAX = 0;
	for(int i=0; i<N; i++) {
		if(t[i] > MAX) {
			MAX = t[i];
		}
	} 
	a = new int[MAX+1];
	//初始化散列表a
	for(int i=0; i<=MAX; i++)  {
		a[i] = 0;
	}
	//将数组t的数据移到散列表a中
	for(int i=0; i<N; i++) {
		a[t[i]]++;
	} 
	//打印散列表a
	for(int i=0; i<=MAX; i++) {
		if(a[i] != 0) {
			cout << i << ":" << a[i] << endl;
		}
	} 
	return 0;
}
